---
kind: property
id: P:Autodesk.Revit.DB.WallType.Kind
source: html/e37962e2-33e6-f598-1b33-aef9770ef885.htm
---
# Autodesk.Revit.DB.WallType.Kind Property

The nature of the wall.

## Syntax (C#)
```csharp
public WallKind Kind { get; }
```